{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Metadata describing a UI feature update for renaming the music button label to 'For You'.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/.env": "Sets the audio source path used by the MusicPlayer component.",
  "frontend/.env.example": "Documents optional audio source configuration for the MusicPlayer.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app at the root div.",
  "frontend/src/App.tsx": "Main React app assembling themed layout with decorative components and primary sections.",
  "frontend/src/components/FloatingHearts.tsx": "Generates animated floating heart icons with randomized positions and timing.",
  "frontend/src/components/FloatingMessages.tsx": "Creates rotating romantic messages that float horizontally across the screen.",
  "frontend/src/components/Footer.tsx": "Displays a themed footer with love‑themed text and attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links and mobile menu toggle.",
  "frontend/src/components/Hero.tsx": "Intro hero section with greeting, decorations, and a CTA button.",
  "frontend/src/components/LoveLetter.tsx": "Displays a styled love letter card with decorative elements and heartfelt text.",
  "frontend/src/components/LoveQuiz.tsx": "Empty placeholder file for a love quiz component.",
  "frontend/src/components/Memories.tsx": "Displays a grid of themed memory images with captions and hover animations.",
  "frontend/src/components/MusicPlayer.tsx": "Implements an audio player with play, mute, volume controls, and a Web Audio fallback tone.",
  "frontend/src/components/Sparkles.tsx": "Generates animated sparkle icons positioned randomly across the screen.",
  "frontend/src/components/ValentineProposal.tsx": "Renders an interactive Valentine prompt with moving 'No' button, confetti, and success animation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing for frontend-only setup.",
  "frontend/src/hooks/useSmoothScroll.ts": "Offers a helper to smoothly scroll to page sections by ID.",
  "frontend/src/index.css": "Global Tailwind-based styles, fonts, CSS variables, and custom animation keyframes.",
  "frontend/src/main.tsx": "Initializes the React app with Internet Identity and React Query providers.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, content scanning, extended theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing a Valentine’s single‑page site, its features, constraints, known issues, and architectural notes for build planning."
}