{
  "kind": "build_request",
  "title": "Connect uploaded audio file to MusicPlayer for real playback",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Configure the MusicPlayer to play the user-uploaded audio file for the track “Hum Tere Pyaar Mein — Lata Mangeshkar” by setting the runtime audio source (import.meta.env.VITE_HUM_TERE_PYAAR_MEIN_AUDIO_SRC) to the uploaded file’s public asset path, so clicking Play plays the real song (not the fallback tone).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i have uploded it already"
        ]
      },
      "acceptanceCriteria": [
        "When VITE_HUM_TERE_PYAAR_MEIN_AUDIO_SRC points to the uploaded audio file (a public asset path), pressing Play starts HTMLAudioElement playback of that file and loops it.",
        "If the configured source is missing/empty/unplayable, the MusicPlayer continues to function and falls back to the existing generated-tone behavior without UI errors or crashes.",
        "No Spotify link playback is attempted; playback uses only a direct audio file source (local public asset path)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; do not introduce additional backend services.",
    "Use English for any user-facing text in the build request.",
    "Spotify track links cannot be used as playable audio sources; only direct audio file URLs or local public assets are supported."
  ],
  "nonGoals": [
    "Adding Spotify embed/integration or playing audio directly from open.spotify.com links.",
    "Implementing backend storage, uploads, or audio hosting logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}